package com.example.astrohandbook

object NewsRepository {
    // Константный список из 10 новостей на астрономическую тему
    val newsList = listOf(
        NewsItem(1, "Марс: следующая цель человечества"),
        NewsItem(2, "Обнаружена новая экзопланета в зоне обитаемости"),
        NewsItem(3, "Телескоп Джеймс Уэбб сделал снимок 'Столпов Творения'"),
        NewsItem(4, "SpaceX успешно протестировала Starship"),
        NewsItem(5, "Солнце приближается к пику активности"),
        NewsItem(6, "Китай запустил миссию на обратную сторону Луны"),
        NewsItem(7, "Астрономы нашли кольца у карликовой планеты"),
        NewsItem(8, "Запущен новый спутник для изучения черных дыр"),
        NewsItem(9, "Метеорный поток Персеиды в этом году будет ярким"),
        NewsItem(10, "На Венере обнаружен возможный признак жизни"),
    )
}